tap "homebrew/cask"

brew "ack"
brew "fzf"
brew "ctags"
brew "pv"
brew "ripgrep"
brew "shellcheck"
brew "tree"
brew "wget"

brew "git"
brew "hub"
brew "macvim"

brew "openssl"
brew "nodenv"
brew "coreutils" # Necessary to build native exensions in newer macOS's. 🤷
brew "node-build"
brew "rbenv"
brew "rbenv-ctag"
brew "ruby-build"
brew "node"
brew "yarn"

brew "graphicsmagick"
brew "imagemagick"
brew "jq"

brew "postgresql"
brew "redis"

brew "shellcheck"
brew "tldr"
