cask_args appdir: "/Applications"
tap "heroku/brew"
tap "homebrew/cask"
tap "kryptco/tap"
tap "universal-ctags/universal-ctags"

brew "ack"
brew "bat"
brew "fzf"
brew "universal-ctags", args: ["HEAD"]
brew "pv"
brew "ripgrep"
brew "shellcheck"
brew "tree"
brew "wget"

brew "git"
brew "git-delta"
brew "heroku"
brew "hub"
brew "kr" # https://krypt.co/kr
brew "macvim"

brew "openssl"
brew "nodenv"
brew "coreutils" # Necessary to build native exensions in newer macOS's. 🤷
brew "node-build"
brew "rbenv"
brew "rbenv-bundler-ruby-version"
brew "rbenv-ctags"
brew "rbenv-default-gems"
brew "ruby-build"
brew "node"
brew "yarn"

brew "graphicsmagick"
brew "imagemagick"
brew "jq"

brew "postgresql"
brew "redis"

brew "shellcheck"
brew "tldr"
